artillery/auth.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 10
      arrivalRate: 5
scenarios:
  - name: Auth login
    flow:
      - post:
          url: '/auth/login'
          json:
            email: 'user@example.com'
            password: 'secret123'
          capture:
            - json: $.accessToken
              as: accessToken
            - json: $.refreshToken
              as: refreshToken