artillery/order.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 10
scenarios:
  - name: Auth then call Order post and fetch by Id
    flow:
      - post:
          url: '/auth/login'
          json:
            email: 'user@example.com'
            password: 'secret123'
          capture:
            - json: $.accessToken
              as: accessToken
      - post:
          url: '/order'
          headers:
            Authorization: 'Bearer {{ accessToken }}'
          json:
            productIds: [1]
          capture:
            - json: $.id
              as: orderId
      - get:
          url: '/order/1'
          headers:
            Authorization: 'Bearer {{ accessToken }}'