artillery/order.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 10
  defaults:
    headers:
      content-type: application/json
  variables:
    email: 'user@example.com'
    password: 'secret123'

scenarios:
  - name: Auth then call Order post and fetch by Id
    flow:
      - post:
          url: '/auth/login'
          json:
            email: '{{ email }}'
            password: '{{ password }}'
          capture:
            - json: $.accessToken
              as: accessToken
          expect:
            - statusCode: 201
      - post:
          url: '/order'
          headers:
            Authorization: 'Bearer {{ accessToken }}'
          json:
            productIds: [1]
          capture:
            - json: $.id
              as: orderId
          expect:
            - statusCode: 201
      - get:
          url: '/order/1'
          headers:
            Authorization: 'Bearer {{ accessToken }}'
          expect:
            - statusCode: 200